Merge pull request #1 from A-Words/wly2
docs(report): convert report diagrams to Mermaid
